Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f40x/mcumap_stm32f40x.h
#define DOUT6_CR CRH
#endif
#define DIO42 42
#define DIO42_PORT DOUT6_PORT
#define DIO42_BIT DOUT6_BIT
#define DIO42_APB2EN DOUT6_APB2EN
#define DIO42_GPIO DOUT6_GPIO
#define DIO42_CR DOUT6_CR
#define DIO42_CROFF DOUT6_CROFF
#endif
#if (defined(DOUT7_PORT) && defined(DOUT7_BIT))
#define DOUT7 43
#define DOUT7_APB2EN (__rccapb2gpioen__(DOUT7_PORT))
#define DOUT7_GPIO (__gpio__(DOUT7_PORT))
#if (DOUT7_BIT < 8)
#define DOUT7_CROFF DOUT7_BIT
#define DOUT7_CR CRL
#else
#define DOUT7_CROFF (DOUT7_BIT & 0x07)
#define DOUT7_CR CRH
#endif
#define DIO43 43
#define DIO43_PORT DOUT7_PORT
#define DIO43_BIT DOUT7_BIT
#define DIO43_APB2EN DOUT7_APB2EN
#define DIO43_GPIO DOUT7_GPIO
#define DIO43_CR DOUT7_CR
#define DIO43_CROFF DOUT7_CROFF
#endif
#if (defined(DOUT8_PORT) && defined(DOUT8_BIT))
#define DOUT8 44
#define DOUT8_APB2EN (__rccapb2gpioen__(DOUT8_PORT))
#define DOUT8_GPIO (__gpio__(DOUT8_PORT))
#if (DOUT8_BIT < 8)
#define DOUT8_CROFF DOUT8_BIT
#define DOUT8_CR CRL
#else
#define DOUT8_CROFF (DOUT8_BIT & 0x07)
#define DOUT8_CR CRH
#endif
#define DIO44 44
#define DIO44_PORT DOUT8_PORT
#define DIO44_BIT DOUT8_BIT
#define DIO44_APB2EN DOUT8_APB2EN
#define DIO44_GPIO DOUT8_GPIO
#define DIO44_CR DOUT8_CR
#define DIO44_CROFF DOUT8_CROFF
#endif
#if (defined(DOUT9_PORT) && defined(DOUT9_BIT))
#define DOUT9 45
#define DOUT9_APB2EN (__rccapb2gpioen__(DOUT9_PORT))
#define DOUT9_GPIO (__gpio__(DOUT9_PORT))
#if (DOUT9_BIT < 8)
#define DOUT9_CROFF DOUT9_BIT
#define DOUT9_CR CRL
#else
#define DOUT9_CROFF (DOUT9_BIT & 0x07)
#define DOUT9_CR CRH
#endif
#define DIO45 45
#define DIO45_PORT DOUT9_PORT
#define DIO45_BIT DOUT9_BIT
#define DIO45_APB2EN DOUT9_APB2EN
#define DIO45_GPIO DOUT9_GPIO
#define DIO45_CR DOUT9_CR
#define DIO45_CROFF DOUT9_CROFF
#endif
#if (defined(DOUT10_PORT) && defined(DOUT10_BIT))
#define DOUT10 46
#define DOUT10_APB2EN (__rccapb2gpioen__(DOUT10_PORT))
#define DOUT10_GPIO (__gpio__(DOUT10_PORT))
#if (DOUT10_BIT < 8)
#define DOUT10_CROFF DOUT10_BIT
#define DOUT10_CR CRL
#else
#define DOUT10_CROFF (DOUT10_BIT & 0x07)
#define DOUT10_CR CRH
#endif
#define DIO46 46
#define DIO46_PORT DOUT10_PORT
#define DIO46_BIT DOUT10_BIT
#define DIO46_APB2EN DOUT10_APB2EN
#define DIO46_GPIO DOUT10_GPIO
#define DIO46_CR DOUT10_CR
#define DIO46_CROFF DOUT10_CROFF
#endif
#if (defined(DOUT11_PORT) && defined(DOUT11_BIT))
#define DOUT11 47
#define DOUT11_APB2EN (__rccapb2gpioen__(DOUT11_PORT))
#define DOUT11_GPIO (__gpio__(DOUT11_PORT))
#if (DOUT11_BIT < 8)
#define DOUT11_CROFF DOUT11_BIT
#define DOUT11_CR CRL
#else
#define DOUT11_CROFF (DOUT11_BIT & 0x07)
#define DOUT11_CR CRH
#endif
#define DIO47 47
#define DIO47_PORT DOUT11_PORT
#define DIO47_BIT DOUT11_BIT
#define DIO47_APB2EN DOUT11_APB2EN
#define DIO47_GPIO DOUT11_GPIO
#define DIO47_CR DOUT11_CR
#define DIO47_CROFF DOUT11_CROFF
#endif
#if (defined(DOUT12_PORT) && defined(DOUT12_BIT))
#define DOUT12 48
#define DOUT12_APB2EN (__rccapb2gpioen__(DOUT12_PORT))
#define DOUT12_GPIO (__gpio__(DOUT12_PORT))
#if (DOUT12_BIT < 8)
#define DOUT12_CROFF DOUT12_BIT
#define DOUT12_CR CRL
#else
#define DOUT12_CROFF (DOUT12_BIT & 0x07)
#define DOUT12_CR CRH
#endif
#define DIO48 48
#define DIO48_PORT DOUT12_PORT
#define DIO48_BIT DOUT12_BIT
#define DIO48_APB2EN DOUT12_APB2EN
#define DIO48_GPIO DOUT12_GPIO
#define DIO48_CR DOUT12_CR
#define DIO48_CROFF DOUT12_CROFF
#endif
#if (defined(DOUT13_PORT) && defined(DOUT13_BIT))
#define DOUT13 49
#define DOUT13_APB2EN (__rccapb2gpioen__(DOUT13_PORT))
#define DOUT13_GPIO (__gpio__(DOUT13_PORT))
#if (DOUT13_BIT < 8)
#define DOUT13_CROFF DOUT13_BIT
#define DOUT13_CR CRL
#else
#define DOUT13_CROFF (DOUT13_BIT & 0x07)
#define DOUT13_CR CRH
#endif
#define DIO49 49
#define DIO49_PORT DOUT13_PORT
#define DIO49_BIT DOUT13_BIT
#define DIO49_APB2EN DOUT13_APB2EN
#define DIO49_GPIO DOUT13_GPIO
#define DIO49_CR DOUT13_CR
#define DIO49_CROFF DOUT13_CROFF
#endif
#if (defined(DOUT14_PORT) && defined(DOUT14_BIT))
#define DOUT14 50
#define DOUT14_APB2EN (__rccapb2gpioen__(DOUT14_PORT))
#define DOUT14_GPIO (__gpio__(DOUT14_PORT))
#if (DOUT14_BIT < 8)
#define DOUT14_CROFF DOUT14_BIT
#define DOUT14_CR CRL
#else
#define DOUT14_CROFF (DOUT14_BIT & 0x07)
#define DOUT14_CR CRH
#endif
#define DIO50 50
#define DIO50_PORT DOUT14_PORT
#define DIO50_BIT DOUT14_BIT
#define DIO50_APB2EN DOUT14_APB2EN
#define DIO50_GPIO DOUT14_GPIO
#define DIO50_CR DOUT14_CR
#define DIO50_CROFF DOUT14_CROFF
#endif
#if (defined(DOUT15_PORT) && defined(DOUT15_BIT))
#define DOUT15 51
#define DOUT15_APB2EN (__rccapb2gpioen__(DOUT15_PORT))
#define DOUT15_GPIO (__gpio__(DOUT15_PORT))
#if (DOUT15_BIT < 8)
#define DOUT15_CROFF DOUT15_BIT
#define DOUT15_CR CRL
#else
#define DOUT15_CROFF (DOUT15_BIT & 0x07)
#define DOUT15_CR CRH
#endif
#define DIO51 51
#define DIO51_PORT DOUT15_PORT
#define DIO51_BIT DOUT15_BIT
#define DIO51_APB2EN DOUT15_APB2EN
#define DIO51_GPIO DOUT15_GPIO
#define DIO51_CR DOUT15_CR
#define DIO51_CROFF DOUT15_CROFF
#endif
#if (defined(LIMIT_X_PORT) && defined(LIMIT_X_BIT))
#define LIMIT_X 52
#define LIMIT_X_APB2EN (__rccapb2gpioen__(LIMIT_X_PORT))
#define LIMIT_X_GPIO (__gpio__(LIMIT_X_PORT))
#if (LIMIT_X_BIT < 8)
#define LIMIT_X_CROFF LIMIT_X_BIT
#define LIMIT_X_CR CRL
#else
#define LIMIT_X_CROFF (LIMIT_X_BIT & 0x07)
#define LIMIT_X_CR CRH
#endif
#define DIO52 52
#define DIO52_PORT LIMIT_X_PORT
#define DIO52_BIT LIMIT_X_BIT
#define DIO52_APB2EN LIMIT_X_APB2EN
#define DIO52_GPIO LIMIT_X_GPIO
#define DIO52_CR LIMIT_X_CR
#define DIO52_CROFF LIMIT_X_CROFF
#endif
#if (defined(LIMIT_Y_PORT) && defined(LIMIT_Y_BIT))
#define LIMIT_Y 53
#define LIMIT_Y_APB2EN (__rccapb2gpioen__(LIMIT_Y_PORT))
#define LIMIT_Y_GPIO (__gpio__(LIMIT_Y_PORT))
#if (LIMIT_Y_BIT < 8)
#define LIMIT_Y_CROFF LIMIT_Y_BIT
#define LIMIT_Y_CR CRL
#else
#define LIMIT_Y_CROFF (LIMIT_Y_BIT & 0x07)
#define LIMIT_Y_CR CRH
#endif
#define DIO53 53
#define DIO53_PORT LIMIT_Y_PORT
#define DIO53_BIT LIMIT_Y_BIT
#define DIO53_APB2EN LIMIT_Y_APB2EN
#define DIO53_GPIO LIMIT_Y_GPIO
#define DIO53_CR LIMIT_Y_CR
#define DIO53_CROFF LIMIT_Y_CROFF
#endif
#if (defined(LIMIT_Z_PORT) && defined(LIMIT_Z_BIT))
#define LIMIT_Z 54
#define LIMIT_Z_APB2EN (__rccapb2gpioen__(LIMIT_Z_PORT))
#define LIMIT_Z_GPIO (__gpio__(LIMIT_Z_PORT))
#if (LIMIT_Z_BIT < 8)
#define LIMIT_Z_CROFF LIMIT_Z_BIT
#define LIMIT_Z_CR CRL
#else
#define LIMIT_Z_CROFF (LIMIT_Z_BIT & 0x07)
#define LIMIT_Z_CR CRH
#endif
#define DIO54 54
#define DIO54_PORT LIMIT_Z_PORT
#define DIO54_BIT LIMIT_Z_BIT
#define DIO54_APB2EN LIMIT_Z_APB2EN
#define DIO54_GPIO LIMIT_Z_GPIO
#define DIO54_CR LIMIT_Z_CR
#define DIO54_CROFF LIMIT_Z_CROFF
#endif
#if (defined(LIMIT_X2_PORT) && defined(LIMIT_X2_BIT))
#define LIMIT_X2 55
#define LIMIT_X2_APB2EN (__rccapb2gpioen__(LIMIT_X2_PORT))
#define LIMIT_X2_GPIO (__gpio__(LIMIT_X2_PORT))
#if (LIMIT_X2_BIT < 8)
#define LIMIT_X2_CROFF LIMIT_X2_BIT
#define LIMIT_X2_CR CRL
#else
#define LIMIT_X2_CROFF (LIMIT_X2_BIT & 0x07)
#define LIMIT_X2_CR CRH
#endif
#define DIO55 55
#define DIO55_PORT LIMIT_X2_PORT
#define DIO55_BIT LIMIT_X2_BIT
#define DIO55_APB2EN LIMIT_X2_APB2EN
#define DIO55_GPIO LIMIT_X2_GPIO
#define DIO55_CR LIMIT_X2_CR
#define DIO55_CROFF LIMIT_X2_CROFF
#endif
#if (defined(LIMIT_Y2_PORT) && defined(LIMIT_Y2_BIT))
#define LIMIT_Y2 56
#define LIMIT_Y2_APB2EN (__rccapb2gpioen__(LIMIT_Y2_PORT))
#define LIMIT_Y2_GPIO (__gpio__(LIMIT_Y2_PORT))
#if (LIMIT_Y2_BIT < 8)
#define LIMIT_Y2_CROFF LIMIT_Y2_BIT
#define LIMIT_Y2_CR CRL
#else
#define LIMIT_Y2_CROFF (LIMIT_Y2_BIT & 0x07)
#define LIMIT_Y2_CR CRH
#endif
#define DIO56 56
#define DIO56_PORT LIMIT_Y2_PORT
#define DIO56_BIT LIMIT_Y2_BIT
#define DIO56_APB2EN LIMIT_Y2_APB2EN
#define DIO56_GPIO LIMIT_Y2_GPIO
#define DIO56_CR LIMIT_Y2_CR
#define DIO56_CROFF LIMIT_Y2_CROFF
#endif
#if (defined(LIMIT_Z2_PORT) && defined(LIMIT_Z2_BIT))
#define LIMIT_Z2 57
#define LIMIT_Z2_APB2EN (__rccapb2gpioen__(LIMIT_Z2_PORT))
#define LIMIT_Z2_GPIO (__gpio__(LIMIT_Z2_PORT))
#if (LIMIT_Z2_BIT < 8)
#define LIMIT_Z2_CROFF LIMIT_Z2_BIT
#define LIMIT_Z2_CR CRL
#else
#define LIMIT_Z2_CROFF (LIMIT_Z2_BIT & 0x07)
#define LIMIT_Z2_CR CRH
#endif
#define DIO57 57
#define DIO57_PORT LIMIT_Z2_PORT
#define DIO57_BIT LIMIT_Z2_BIT
#define DIO57_APB2EN LIMIT_Z2_APB2EN
#define DIO57_GPIO LIMIT_Z2_GPIO
#define DIO57_CR LIMIT_Z2_CR
#define DIO57_CROFF LIMIT_Z2_CROFF
#endif
#if (defined(LIMIT_A_PORT) && defined(LIMIT_A_BIT))
#define LIMIT_A 58
#define LIMIT_A_APB2EN (__rccapb2gpioen__(LIMIT_A_PORT))
#define LIMIT_A_GPIO (__gpio__(LIMIT_A_PORT))
#if (LIMIT_A_BIT < 8)
#define LIMIT_A_CROFF LIMIT_A_BIT
#define LIMIT_A_CR CRL
#else
#define LIMIT_A_CROFF (LIMIT_A_BIT & 0x07)
#define LIMIT_A_CR CRH
#endif
#define DIO58 58
#define DIO58_PORT LIMIT_A_PORT
#define DIO58_BIT LIMIT_A_BIT
#define DIO58_APB2EN LIMIT_A_APB2EN
#define DIO58_GPIO LIMIT_A_GPIO
#define DIO58_CR LIMIT_A_CR
#define DIO58_CROFF LIMIT_A_CROFF
#endif
#if (defined(LIMIT_B_PORT) && defined(LIMIT_B_BIT))
#define LIMIT_B 59
#define LIMIT_B_APB2EN (__rccapb2gpioen__(LIMIT_B_PORT))
#define LIMIT_B_GPIO (__gpio__(LIMIT_B_PORT))
#if (LIMIT_B_BIT < 8)
#define LIMIT_B_CROFF LIMIT_B_BIT
#define LIMIT_B_CR CRL
#else
#define LIMIT_B_CROFF (LIMIT_B_BIT & 0x07)
#define LIMIT_B_CR CRH
#endif
#define DIO59 59
#define DIO59_PORT LIMIT_B_PORT
#define DIO59_BIT LIMIT_B_BIT
#define DIO59_APB2EN LIMIT_B_APB2EN
#define DIO59_GPIO LIMIT_B_GPIO
#define DIO59_CR LIMIT_B_CR
#define DIO59_CROFF LIMIT_B_CROFF
#endif
#if (defined(LIMIT_C_PORT) && defined(LIMIT_C_BIT))
#define LIMIT_C 60
#define LIMIT_C_APB2EN (__rccapb2gpioen__(LIMIT_C_PORT))
#define LIMIT_C_GPIO (__gpio__(LIMIT_C_PORT))
#if (LIMIT_C_BIT < 8)
#define LIMIT_C_CROFF LIMIT_C_BIT
#define LIMIT_C_CR CRL
#else
#define LIMIT_C_CROFF (LIMIT_C_BIT & 0x07)
#define LIMIT_C_CR CRH
#endif
#define DIO60 60
#define DIO60_PORT LIMIT_C_PORT
#define DIO60_BIT LIMIT_C_BIT
#define DIO60_APB2EN LIMIT_C_APB2EN
#define DIO60_GPIO LIMIT_C_GPIO
#define DIO60_CR LIMIT_C_CR
#define DIO60_CROFF LIMIT_C_CROFF
#endif
#if (defined(PROBE_PORT) && defined(PROBE_BIT))
#define PROBE 61
#define PROBE_APB2EN (__rccapb2gpioen__(PROBE_PORT))
#define PROBE_GPIO (__gpio__(PROBE_PORT))
#if (PROBE_BIT < 8)
#define PROBE_CROFF PROBE_BIT
#define PROBE_CR CRL
#else
#define PROBE_CROFF (PROBE_BIT & 0x07)
#define PROBE_CR CRH
#endif
#define DIO61 61
#define DIO61_PORT PROBE_PORT
#define DIO61_BIT PROBE_BIT
#define DIO61_APB2EN PROBE_APB2EN
#define DIO61_GPIO PROBE_GPIO
#define DIO61_CR PROBE_CR
#define DIO61_CROFF PROBE_CROFF
#endif
#if (defined(ESTOP_PORT) && defined(ESTOP_BIT))
#define ESTOP 62
#define ESTOP_APB2EN (__rccapb2gpioen__(ESTOP_PORT))
#define ESTOP_GPIO (__gpio__(ESTOP_PORT))
#if (ESTOP_BIT < 8)
#define ESTOP_CROFF ESTOP_BIT
#define ESTOP_CR CRL
#else
#define ESTOP_CROFF (ESTOP_BIT & 0x07)
#define ESTOP_CR CRH
#endif
#define DIO62 62
#define DIO62_PORT ESTOP_PORT
#define DIO62_BIT ESTOP_BIT
#define DIO62_APB2EN ESTOP_APB2EN
#define DIO62_GPIO ESTOP_GPIO
#define DIO62_CR ESTOP_CR
#define DIO62_CROFF ESTOP_CROFF
#endif
#if (defined(SAFETY_DOOR_PORT) && defined(SAFETY_DOOR_BIT))
#define SAFETY_DOOR 63
#define SAFETY_DOOR_APB2EN (__rccapb2gpioen__(SAFETY_DOOR_PORT))
#define SAFETY_DOOR_GPIO (__gpio__(SAFETY_DOOR_PORT))
#if (SAFETY_DOOR_BIT < 8)
#define SAFETY_DOOR_CROFF SAFETY_DOOR_BIT
#define SAFETY_DOOR_CR CRL
#else
#define SAFETY_DOOR_CROFF (SAFETY_DOOR_BIT & 0x07)
#define SAFETY_DOOR_CR CRH
#endif
#define DIO63 63
#define DIO63_PORT SAFETY_DOOR_PORT
#define DIO63_BIT SAFETY_DOOR_BIT
#define DIO63_APB2EN SAFETY_DOOR_APB2EN
#define DIO63_GPIO SAFETY_DOOR_GPIO
#define DIO63_CR SAFETY_DOOR_CR
#define DIO63_CROFF SAFETY_DOOR_CROFF
#endif
#if (defined(FHOLD_PORT) && defined(FHOLD_BIT))
#define FHOLD 64
#define FHOLD_APB2EN (__rccapb2gpioen__(FHOLD_PORT))
#define FHOLD_GPIO (__gpio__(FHOLD_PORT))
#if (FHOLD_BIT < 8)
#define FHOLD_CROFF FHOLD_BIT
#define FHOLD_CR CRL
#else
#define FHOLD_CROFF (FHOLD_BIT & 0x07)
#define FHOLD_CR CRH
#endif
#define DIO64 64
#define DIO64_PORT FHOLD_PORT
#define DIO64_BIT FHOLD_BIT
#define DIO64_APB2EN FHOLD_APB2EN
#define DIO64_GPIO FHOLD_GPIO
#define DIO64_CR FHOLD_CR
#define DIO64_CROFF FHOLD_CROFF
#endif
#if (defined(CS_RES_PORT) && defined(CS_RES_BIT))
#define CS_RES 65
#define CS_RES_APB2EN (__rccapb2gpioen__(CS_RES_PORT))
#define CS_RES_GPIO (__gpio__(CS_RES_PORT))
#if (CS_RES_BIT < 8)
#define CS_RES_CROFF CS_RES_BIT
#define CS_RES_CR CRL
#else
#define CS_RES_CROFF (CS_RES_BIT & 0x07)
#define CS_RES_CR CRH
#endif
#define DIO65 65
#define DIO65_PORT CS_RES_PORT
#define DIO65_BIT CS_RES_BIT
#define DIO65_APB2EN CS_RES_APB2EN
#define DIO65_GPIO CS_RES_GPIO
#define DIO65_CR CS_RES_CR
#define DIO65_CROFF CS_RES_CROFF
#endif
#if (defined(ANALOG0_PORT) && defined(ANALOG0_BIT))
#define ANALOG0 66
#define ANALOG0_APB2EN (__rccapb2gpioen__(ANALOG0_PORT))
#define ANALOG0_GPIO (__gpio__(ANALOG0_PORT))
#if (ANALOG0_BIT < 8)
#define ANALOG0_CROFF ANALOG0_BIT
#define ANALOG0_CR CRL
#else
#define ANALOG0_CROFF (ANALOG0_BIT & 0x07)
#define ANALOG0_CR CRH
#endif
#define DIO66 66
#define DIO66_PORT ANALOG0_PORT
#define DIO66_BIT ANALOG0_BIT
#define DIO66_APB2EN ANALOG0_APB2EN
#define DIO66_GPIO ANALOG0_GPIO
#define DIO66_CR ANALOG0_CR
#define DIO66_CROFF ANALOG0_CROFF
#endif
#if (defined(ANALOG1_PORT) && defined(ANALOG1_BIT))
#define ANALOG1 67
#define ANALOG1_APB2EN (__rccapb2gpioen__(ANALOG1_PORT))
#define ANALOG1_GPIO (__gpio__(ANALOG1_PORT))
#if (ANALOG1_BIT < 8)
#define ANALOG1_CROFF ANALOG1_BIT
#define ANALOG1_CR CRL
#else
#define ANALOG1_CROFF (ANALOG1_BIT & 0x07)
#define ANALOG1_CR CRH
#endif
#define DIO67 67
#define DIO67_PORT ANALOG1_PORT
#define DIO67_BIT ANALOG1_BIT
#define DIO67_APB2EN ANALOG1_APB2EN
#define DIO67_GPIO ANALOG1_GPIO
#define DIO67_CR ANALOG1_CR
#define DIO67_CROFF ANALOG1_CROFF
#endif
#if (defined(ANALOG2_PORT) && defined(ANALOG2_BIT))
#define ANALOG2 68
#define ANALOG2_APB2EN (__rccapb2gpioen__(ANALOG2_PORT))
#define ANALOG2_GPIO (__gpio__(ANALOG2_PORT))
#if (ANALOG2_BIT < 8)
#define ANALOG2_CROFF ANALOG2_BIT
#define ANALOG2_CR CRL
#else
#define ANALOG2_CROFF (ANALOG2_BIT & 0x07)
#define ANALOG2_CR CRH
#endif
#define DIO68 68
#define DIO68_PORT ANALOG2_PORT
#define DIO68_BIT ANALOG2_BIT
#define DIO68_APB2EN ANALOG2_APB2EN
#define DIO68_GPIO ANALOG2_GPIO
#define DIO68_CR ANALOG2_CR
#define DIO68_CROFF ANALOG2_CROFF
#endif
#if (defined(ANALOG3_PORT) && defined(ANALOG3_BIT))
#define ANALOG3 69
#define ANALOG3_APB2EN (__rccapb2gpioen__(ANALOG3_PORT))
#define ANALOG3_GPIO (__gpio__(ANALOG3_PORT))
#if (ANALOG3_BIT < 8)
#define ANALOG3_CROFF ANALOG3_BIT
#define ANALOG3_CR CRL
#else
#define ANALOG3_CROFF (ANALOG3_BIT & 0x07)
#define ANALOG3_CR CRH
#endif
#define DIO69 69
#define DIO69_PORT ANALOG3_PORT
#define DIO69_BIT ANALOG3_BIT
#define DIO69_APB2EN ANALOG3_APB2EN
#define DIO69_GPIO ANALOG3_GPIO
#define DIO69_CR ANALOG3_CR
#define DIO69_CROFF ANALOG3_CROFF
#endif
#if (defined(ANALOG4_PORT) && defined(ANALOG4_BIT))
#define ANALOG4 70
#define ANALOG4_APB2EN (__rccapb2gpioen__(ANALOG4_PORT))
#define ANALOG4_GPIO (__gpio__(ANALOG4_PORT))
#if (ANALOG4_BIT < 8)
#define ANALOG4_CROFF ANALOG4_BIT
#define ANALOG4_CR CRL
#else
#define ANALOG4_CROFF (ANALOG4_BIT & 0x07)
#define ANALOG4_CR CRH
#endif
#define DIO70 70
#define DIO70_PORT ANALOG4_PORT
#define DIO70_BIT ANALOG4_BIT
#define DIO70_APB2EN ANALOG4_APB2EN
#define DIO70_GPIO ANALOG4_GPIO
#define DIO70_CR ANALOG4_CR
#define DIO70_CROFF ANALOG4_CROFF
#endif
#if (defined(ANALOG5_PORT) && defined(ANALOG5_BIT))
#define ANALOG5 71
#define ANALOG5_APB2EN (__rccapb2gpioen__(ANALOG5_PORT))
#define ANALOG5_GPIO (__gpio__(ANALOG5_PORT))
#if (ANALOG5_BIT < 8)
#define ANALOG5_CROFF ANALOG5_BIT
#define ANALOG5_CR CRL
#else
#define ANALOG5_CROFF (ANALOG5_BIT & 0x07)
#define ANALOG5_CR CRH
#endif
#define DIO71 71
#define DIO71_PORT ANALOG5_PORT
#define DIO71_BIT ANALOG5_BIT
#define DIO71_APB2EN ANALOG5_APB2EN
#define DIO71_GPIO ANALOG5_GPIO
#define DIO71_CR ANALOG5_CR
#define DIO71_CROFF ANALOG5_CROFF
#endif
#if (defined(ANALOG6_PORT) && defined(ANALOG6_BIT))
#define ANALOG6 72
#define ANALOG6_APB2EN (__rccapb2gpioen__(ANALOG6_PORT))
#define ANALOG6_GPIO (__gpio__(ANALOG6_PORT))
#if (ANALOG6_BIT < 8)
#define ANALOG6_CROFF ANALOG6_BIT
#define ANALOG6_CR CRL
#else
#define ANALOG6_CROFF (ANALOG6_BIT & 0x07)
#define ANALOG6_CR CRH
#endif
#define DIO72 72
#define DIO72_PORT ANALOG6_PORT
#define DIO72_BIT ANALOG6_BIT
#define DIO72_APB2EN ANALOG6_APB2EN
#define DIO72_GPIO ANALOG6_GPIO
#define DIO72_CR ANALOG6_CR
#define DIO72_CROFF ANALOG6_CROFF
#endif
#if (defined(ANALOG7_PORT) && defined(ANALOG7_BIT))
#define ANALOG7 73
#define ANALOG7_APB2EN (__rccapb2gpioen__(ANALOG7_PORT))
#define ANALOG7_GPIO (__gpio__(ANALOG7_PORT))
#if (ANALOG7_BIT < 8)
#define ANALOG7_CROFF ANALOG7_BIT
#define ANALOG7_CR CRL
#else
#define ANALOG7_CROFF (ANALOG7_BIT & 0x07)
#define ANALOG7_CR CRH
#endif
#define DIO73 73
#define DIO73_PORT ANALOG7_PORT
#define DIO73_BIT ANALOG7_BIT
#define DIO73_APB2EN ANALOG7_APB2EN
#define DIO73_GPIO ANALOG7_GPIO
#define DIO73_CR ANALOG7_CR
#define DIO73_CROFF ANALOG7_CROFF
#endif
#if (defined(ANALOG8_PORT) && defined(ANALOG8_BIT))
#define ANALOG8 74
#define ANALOG8_APB2EN (__rccapb2gpioen__(ANALOG8_PORT))
#define ANALOG8_GPIO (__gpio__(ANALOG8_PORT))
#if (ANALOG8_BIT < 8)
#define ANALOG8_CROFF ANALOG8_BIT
#define ANALOG8_CR CRL
#else
#define ANALOG8_CROFF (ANALOG8_BIT & 0x07)
#define ANALOG8_CR CRH
#endif
#define DIO74 74
#define DIO74_PORT ANALOG8_PORT
#define DIO74_BIT ANALOG8_BIT
#define DIO74_APB2EN ANALOG8_APB2EN
#define DIO74_GPIO ANALOG8_GPIO
#define DIO74_CR ANALOG8_CR
#define DIO74_CROFF ANALOG8_CROFF
#endif
#if (defined(ANALOG9_PORT) && defined(ANALOG9_BIT))
#define ANALOG9 75
#define ANALOG9_APB2EN (__rccapb2gpioen__(ANALOG9_PORT))
#define ANALOG9_GPIO (__gpio__(ANALOG9_PORT))
#if (ANALOG9_BIT < 8)
#define ANALOG9_CROFF ANALOG9_BIT
#define ANALOG9_CR CRL
#else
#define ANALOG9_CROFF (ANALOG9_BIT & 0x07)
#define ANALOG9_CR CRH
#endif
#define DIO75 75
#define DIO75_PORT ANALOG9_PORT
#define DIO75_BIT ANALOG9_BIT
#define DIO75_APB2EN ANALOG9_APB2EN
#define DIO75_GPIO ANALOG9_GPIO
#define DIO75_CR ANALOG9_CR
#define DIO75_CROFF ANALOG9_CROFF
#endif
#if (defined(ANALOG10_PORT) && defined(ANALOG10_BIT))
#define ANALOG10 76
#define ANALOG10_APB2EN (__rccapb2gpioen__(ANALOG10_PORT))
#define ANALOG10_GPIO (__gpio__(ANALOG10_PORT))
#if (ANALOG10_BIT < 8)
#define ANALOG10_CROFF ANALOG10_BIT
#define ANALOG10_CR CRL
#else
#define ANALOG10_CROFF (ANALOG10_BIT & 0x07)
#define ANALOG10_CR CRH
#endif
#define DIO76 76
#define DIO76_PORT ANALOG10_PORT
#define DIO76_BIT ANALOG10_BIT
#define DIO76_APB2EN ANALOG10_APB2EN
#define DIO76_GPIO ANALOG10_GPIO
#define DIO76_CR ANALOG10_CR
#define DIO76_CROFF ANALOG10_CROFF
#endif
#if (defined(ANALOG11_PORT) && defined(ANALOG11_BIT))
#define ANALOG11 77
#define ANALOG11_APB2EN (__rccapb2gpioen__(ANALOG11_PORT))
#define ANALOG11_GPIO (__gpio__(ANALOG11_PORT))
#if (ANALOG11_BIT < 8)
#define ANALOG11_CROFF ANALOG11_BIT
#define ANALOG11_CR CRL
#else
#define ANALOG11_CROFF (ANALOG11_BIT & 0x07)
#define ANALOG11_CR CRH
#endif
#define DIO77 77
#define DIO77_PORT ANALOG11_PORT
#define DIO77_BIT ANALOG11_BIT
#define DIO77_APB2EN ANALOG11_APB2EN
#define DIO77_GPIO ANALOG11_GPIO
#define DIO77_CR ANALOG11_CR
#define DIO77_CROFF ANALOG11_CROFF
#endif
#if (defined(ANALOG12_PORT) && defined(ANALOG12_BIT))
#define ANALOG12 78
#define ANALOG12_APB2EN (__rccapb2gpioen__(ANALOG12_PORT))
#define ANALOG12_GPIO (__gpio__(ANALOG12_PORT))
#if (ANALOG12_BIT < 8)
#define ANALOG12_CROFF ANALOG12_BIT
#define ANALOG12_CR CRL
#else
#define ANALOG12_CROFF (ANALOG12_BIT & 0x07)
#define ANALOG12_CR CRH
#endif
#define DIO78 78
#define DIO78_PORT ANALOG12_PORT
#define DIO78_BIT ANALOG12_BIT
#define DIO78_APB2EN ANALOG12_APB2EN
#define DIO78_GPIO ANALOG12_GPIO
#define DIO78_CR ANALOG12_CR
#define DIO78_CROFF ANALOG12_CROFF
#endif
#if (defined(ANALOG13_PORT) && defined(ANALOG13_BIT))
#define ANALOG13 79
#define ANALOG13_APB2EN (__rccapb2gpioen__(ANALOG13_PORT))
#define ANALOG13_GPIO (__gpio__(ANALOG13_PORT))
#if (ANALOG13_BIT < 8)
#define ANALOG13_CROFF ANALOG13_BIT
#define ANALOG13_CR CRL
#else
#define ANALOG13_CROFF (ANALOG13_BIT & 0x07)
#define ANALOG13_CR CRH
#endif
#define DIO79 79
#define DIO79_PORT ANALOG13_PORT
#define DIO79_BIT ANALOG13_BIT
#define DIO79_APB2EN ANALOG13_APB2EN
#define DIO79_GPIO ANALOG13_GPIO
#define DIO79_CR ANALOG13_CR
#define DIO79_CROFF ANALOG13_CROFF
#endif
#if (defined(ANALOG14_PORT) && defined(ANALOG14_BIT))
#define ANALOG14 80
#define ANALOG14_APB2EN (__rccapb2gpioen__(ANALOG14_PORT))
#define ANALOG14_GPIO (__gpio__(ANALOG14_PORT))
#if (ANALOG14_BIT < 8)
#define ANALOG14_CROFF ANALOG14_BIT
#define ANALOG14_CR CRL
#else
#define ANALOG14_CROFF (ANALOG14_BIT & 0x07)
#define ANALOG14_CR CRH
#endif
#define DIO80 80
#define DIO80_PORT ANALOG14_PORT
#define DIO80_BIT ANALOG14_BIT
#define DIO80_APB2EN ANALOG14_APB2EN
#define DIO80_GPIO ANALOG14_GPIO
#define DIO80_CR ANALOG14_CR
#define DIO80_CROFF ANALOG14_CROFF
#endif
#if (defined(ANALOG15_PORT) && defined(ANALOG15_BIT))
#define ANALOG15 81
#define ANALOG15_APB2EN (__rccapb2gpioen__(ANALOG15_PORT))
#define ANALOG15_GPIO (__gpio__(ANALOG15_PORT))
#if (ANALOG15_BIT < 8)
#define ANALOG15_CROFF ANALOG15_BIT
#define ANALOG15_CR CRL
#else
#define ANALOG15_CROFF (ANALOG15_BIT & 0x07)
#define ANALOG15_CR CRH
#endif
#define DIO81 81
#define DIO81_PORT ANALOG15_PORT
#define DIO81_BIT ANALOG15_BIT
#define DIO81_APB2EN ANALOG15_APB2EN
#define DIO81_GPIO ANALOG15_GPIO
#define DIO81_CR ANALOG15_CR
#define DIO81_CROFF ANALOG15_CROFF
#endif
#if (defined(DIN0_PORT) && defined(DIN0_BIT))
#define DIN0 82
#define DIN0_APB2EN (__rccapb2gpioen__(DIN0_PORT))
#define DIN0_GPIO (__gpio__(DIN0_PORT))
#if (DIN0_BIT < 8)
#define DIN0_CROFF DIN0_BIT
#define DIN0_CR CRL
#else
#define DIN0_CROFF (DIN0_BIT & 0x07)
#define DIN0_CR CRH
#endif
#define DIO82 82
#define DIO82_PORT DIN0_PORT
#define DIO82_BIT DIN0_BIT
#define DIO82_APB2EN DIN0_APB2EN
#define DIO82_GPIO DIN0_GPIO
#define DIO82_CR DIN0_CR
#define DIO82_CROFF DIN0_CROFF
#endif
#if (defined(DIN1_PORT) && defined(DIN1_BIT))
#define DIN1 83
#define DIN1_APB2EN (__rccapb2gpioen__(DIN1_PORT))
#define DIN1_GPIO (__gpio__(DIN1_PORT))
#if (DIN1_BIT < 8)
#define DIN1_CROFF DIN1_BIT
#define DIN1_CR CRL
#else
#define DIN1_CROFF (DIN1_BIT & 0x07)
#define DIN1_CR CRH
#endif
#define DIO83 83
#define DIO83_PORT DIN1_PORT
#define DIO83_BIT DIN1_BIT
#define DIO83_APB2EN DIN1_APB2EN
#define DIO83_GPIO DIN1_GPIO
#define DIO83_CR DIN1_CR
#define DIO83_CROFF DIN1_CROFF
#endif
#if (defined(DIN2_PORT) && defined(DIN2_BIT))
#define DIN2 84
#define DIN2_APB2EN (__rccapb2gpioen__(DIN2_PORT))
#define DIN2_GPIO (__gpio__(DIN2_PORT))
#if (DIN2_BIT < 8)
#define DIN2_CROFF DIN2_BIT
#define DIN2_CR CRL
#else
#define DIN2_CROFF (DIN2_BIT & 0x07)
#define DIN2_CR CRH
#endif
#define DIO84 84
#define DIO84_PORT DIN2_PORT
#define DIO84_BIT DIN2_BIT
#define DIO84_APB2EN DIN2_APB2EN
#define DIO84_GPIO DIN2_GPIO
#define DIO84_CR DIN2_CR
#define DIO84_CROFF DIN2_CROFF
#endif
#if (defined(DIN3_PORT) && defined(DIN3_BIT))
#define DIN3 85
#define DIN3_APB2EN (__rccapb2gpioen__(DIN3_PORT))
#define DIN3_GPIO (__gpio__(DIN3_PORT))
#if (DIN3_BIT < 8)
#define DIN3_CROFF DIN3_BIT
#define DIN3_CR CRL
#else
#define DIN3_CROFF (DIN3_BIT & 0x07)
#define DIN3_CR CRH
#endif
#define DIO85 85
#define DIO85_PORT DIN3_PORT
#define DIO85_BIT DIN3_BIT
#define DIO85_APB2EN DIN3_APB2EN
#define DIO85_GPIO DIN3_GPIO
#define DIO85_CR DIN3_CR
#define DIO85_CROFF DIN3_CROFF
#endif
#if (defined(DIN4_PORT) && defined(DIN4_BIT))
#define DIN4 86
#define DIN4_APB2EN (__rccapb2gpioen__(DIN4_PORT))
#define DIN4_GPIO (__gpio__(DIN4_PORT))
#if (DIN4_BIT < 8)
#define DIN4_CROFF DIN4_BIT
#define DIN4_CR CRL
#else
#define DIN4_CROFF (DIN4_BIT & 0x07)
#define DIN4_CR CRH
#endif
#define DIO86 86
#define DIO86_PORT DIN4_PORT
#define DIO86_BIT DIN4_BIT
#define DIO86_APB2EN DIN4_APB2EN
#define DIO86_GPIO DIN4_GPIO
#define DIO86_CR DIN4_CR
#define DIO86_CROFF DIN4_CROFF
#endif
#if (defined(DIN5_PORT) && defined(DIN5_BIT))
#define DIN5 87
