Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f40x/mcumap_stm32f40x.h
// remmaping and pin checking
//  USART	TX	RX	APB	APB2ENR	REMAP
//  1	A9	A10	APB2ENR	RCC_APB2ENR_USART1EN	0
//  1	B6	B7	APB2ENR	RCC_APB2ENR_USART1EN	1
//  2	A2	A3	APB1ENR	RCC_APB1ENR_USART2EN	0
//  2	D5	D6	APB1ENR	RCC_APB1ENR_USART2EN	1
//  3	B10	B11	APB1ENR	RCC_APB1ENR_USART3EN	0
//  3	C10	C11	APB1ENR	RCC_APB1ENR_USART3EN	1
//  3	D8	D9	APB1ENR	RCC_APB1ENR_USART3EN	3
//  4	C10	C11	APB1ENR	RCC_APB1ENR_UART4EN	x
//  5	C12	D2	APB1ENR	RCC_APB1ENR_UART5EN	x
#if ((COM_PORT == 1) && (TX_BIT == 9) && (RX_BIT == 10) && (TX_PORT == A) && (RX_PORT == A))
#elif ((COM_PORT == 1) && (TX_BIT == 6) && (RX_BIT == 7) && (TX_PORT == B) && (RX_PORT == B))
#define COM_REMAP AFIO_MAPR_USART1_REMAP
#elif ((COM_PORT == 2) && (TX_BIT == 2) && (RX_BIT == 3) && (TX_PORT == A) && (RX_PORT == A))
#elif ((COM_PORT == 2) && (TX_BIT == 5) && (RX_BIT == 6) && (TX_PORT == D) && (RX_PORT == D))
#define COM_REMAP AFIO_MAPR_USART2_REMAP
#elif ((COM_PORT == 3) && (TX_BIT == 10) && (RX_BIT == 11) && (TX_PORT == B) && (RX_PORT == B))
#elif ((COM_PORT == 3) && (TX_BIT == 10) && (RX_BIT == 11) && (TX_PORT == C) && (RX_PORT == C))
#define COM_REMAP AFIO_MAPR_USART3_REMAP_PARTIALREMAP
#elif ((COM_PORT == 3) && (TX_BIT == 8) && (RX_BIT == 9) && (TX_PORT == D) && (RX_PORT == D))
#define COM_REMAP AFIO_MAPR_USART3_REMAP_FULLREMAP
#elif ((COM_PORT == 4) && (TX_BIT == 10) && (RX_BIT == 11) && (TX_PORT == C) && (RX_PORT == C))
#elif ((COM_PORT == 5) && (TX_BIT == 12) && (RX_BIT == 2) && (TX_PORT == C) && (RX_PORT == D))
#else
#error "USART/UART pin configuration not supported"
#endif
#endif

/*#define UCSRB __ucsrbreg__(COM_NUMBER)
#define UCSRA __ucsrareg__(COM_NUMBER)
#define UDRIE __udriereg__(COM_NUMBER)
#define U2X __u2xreg__(COM_NUMBER)
#define UBRRH __ubrrhreg__(COM_NUMBER)
#define UBRRL __ubrrlreg__(COM_NUMBER)
#define RXEN __rxenreg__(COM_NUMBER)
#define TXEN __txenreg__(COM_NUMBER)
#define RXCIE __rxciereg__(COM_NUMBER)
#define UDRE __udrereg__(COM_NUMBER)
#define RXC __rxcreg__(COM_NUMBER)
*/

// Timer registers
#ifndef ITP_TIMER
#define ITP_TIMER 2
#endif
#define mcu_timer_isr __helper__(TIM, ITP_TIMER, _IRQHandler)
#define TIMER_REG __helper__(TIM, ITP_TIMER, )
#if (ITP_TIMER == 1 || (ITP_TIMER >= 8 & ITP_TIMER <= 11))
#define TIMER_ENREG APB2ENR
#define TIMER_RESETREG APB1RSTR
#define TIMER_APB __helper__(RCC_APB2ENR_TIM, ITP_TIMER, EN)
#define TIMER_IRQ __helper__(TIM, ITP_TIMER, _UP_IRQn)
#else
#define TIMER_ENREG APB1ENR
#define TIMER_RESETREG APB1RSTR
#define TIMER_APB __helper__(RCC_APB1ENR_TIM, ITP_TIMER, EN)
#define TIMER_IRQ __helper__(TIM, ITP_TIMER, _IRQn)
#endif

#define __indirect__ex__(X, Y) DIO##X##_##Y
#define __indirect__(X, Y) __indirect__ex__(X, Y)

#ifndef BYTE_OPS
#define BYTE_OPS
// Set bit y in byte x
#define SETBIT(x, y) ((x) |= (1 << (y)))
// Clear bit y in byte x
#define CLEARBIT(x, y) ((x) &= ~(1 << (y)))
// Check bit y in byte x
#define CHECKBIT(x, y) ((x) & (1 << (y)))
// Toggle bit y in byte x
#define TOGGLEBIT(x, y) ((x) ^= (1 << (y)))
// Set byte y in byte x
#define SETFLAG(x, y) ((x) |= (y))
// Clear byte y in byte x
#define CLEARFLAG(x, y) ((x) &= ~(y))
// Check byte y in byte x
#define CHECKFLAG(x, y) ((x) & (y))
// Toggle byte y in byte x
#define TOGGLEFLAG(x, y) ((x) ^= (y))
#endif

#define mcu_get_input(diopin) (CHECKBIT(__indirect__(diopin, GPIO)->IDR, __indirect__(diopin, BIT)))
#define mcu_get_output(diopin) (CHECKBIT(__indirect__(diopin, GPIO)->ODR, __indirect__(diopin, BIT)))
#define mcu_set_output(diopin) (__indirect__(diopin, GPIO)->BSRR = (1U << __indirect__(diopin, BIT)))
#define mcu_clear_output(diopin) (__indirect__(diopin, GPIO)->BRR = (1U << __indirect__(diopin, BIT)))
#define mcu_toggle_output(diopin) (TOGGLEBIT(__indirect__(diopin, GPIO)->ODR, __indirect__(diopin, BIT)))
#define mcu_set_pwm(diopin, pwmvalue)                                                                                                           \
	{                                                                                                                                           \
		__indirect__(diopin, TIMREG)->__indirect__(diopin, CCR) = (uint16_t)((((uint32_t)__indirect__(diopin, TIMREG)->ARR) * pwmvalue) / 255); \
	}
#define mcu_get_pwm(diopin) ((uint8_t)((((uint32_t)__indirect__(diopin, TIMREG)->__indirect__(diopin, CCR)) * 255) / ((uint32_t)__indirect__(diopin, TIMREG)->ARR)))

#define mcu_get_analog(diopin) (                    \
	{                                               \
		ADC1->SQR3 = __indirect__(diopin, CHANNEL); \
		ADC1->CR2 |= ADC_CR2_SWSTART;               \
		ADC1->CR2 &= ~ADC_CR2_SWSTART;              \
		while (!(ADC1->SR & ADC_SR_EOS))            \
			;                                       \
		ADC1->SR &= ~ADC_SR_EOS;                    \
		(0xFF & (ADC1->DR >> 4));                   \
	})
#ifdef PROBE
#ifdef PROBE_ISR
#define mcu_enable_probe_isr() SETBIT(EXTI->IMR, PROBE_BIT)
#define mcu_disable_probe_isr() CLEARBIT(EXTI->IMR, PROBE_BIT)
#else
#define mcu_enable_probe_isr()
#define mcu_disable_probe_isr()
#endif
#endif

	extern volatile bool stm32_global_isr_enabled;
#define mcu_enable_global_isr() (        \
	{                                    \
		__enable_irq();                  \
		stm32_global_isr_enabled = true; \
	})
#define mcu_disable_global_isr() (        \
	{                                     \
		stm32_global_isr_enabled = false; \
		__disable_irq();                  \
	})
#define mcu_get_global_isr() ({ stm32_global_isr_enabled; })

// #ifdef COM_PORT
// #ifndef ENABLE_SYNC_TX
// #define mcu_enable_tx_isr() (COM_USART->CR1 |= (USART_CR1_TXEIE))
// #define mcu_disable_tx_isr() (COM_USART->CR1 &= ~(USART_CR1_TXEIE))
// #else
// #define mcu_enable_tx_isr()
// #define mcu_disable_tx_isr()
// #endif
// #else
// #define mcu_enable_tx_isr()
// #define mcu_disable_tx_isr()
// #endif
#if (INTERFACE == INTERFACE_USART)
#define mcu_rx_ready() (COM_USART->SR & USART_SR_RXNE)
#define mcu_tx_ready() (COM_USART->SR & USART_SR_TXE)
#elif (INTERFACE == INTERFACE_USB)
#define mcu_rx_ready() tud_cdc_n_available(0)
#define mcu_tx_ready() tud_cdc_n_write_available(0)
#endif

#define GPIO_RESET 0xfU
#define GPIO_OUT_PP_50MHZ 0x3U
#define GPIO_OUTALT_PP_50MHZ 0xbU
#define GPIO_OUTALT_OD_50MHZ 0xfU
#define GPIO_IN_FLOAT 0x4U
#define GPIO_IN_PUP 0x8U
#define GPIO_IN_ANALOG 0 // not needed after reseting bits

#ifdef __cplusplus
}
#endif

#endif
